# 참고 : 파이썬 증권데이터 분석(김황후 저)

### p308 듀얼 모멘텀 - 상대 모멘텀(Relative Momentum)
import DualMomentum         # 별도 모듈
dm = DualMomentum.DualMomentum()
rm = dm.get_rltv_momentum('2020-01-01', '2020-12-31', 300)
rm2 = dm.get_rltv_momentum('2021-01-01', '2021.3.18', 10)
"""
     code company  old_price  new_price     returns
0  050120  라이브플렉스        558       4740  749.462366
1  194480  데브시스터즈      14450      82600  471.626298
2  073070     에이팸        407       2035  400.000000
3  121850     코이즈       1405       6300  348.398577
4  020560  아시아나항공       4210      16050  281.235154
5  181340   이즈미디어       6690      21950  228.101644
6  004140      동방       2290       6990  205.240175
7  087730  이엠네트웍스       2720       8160  200.000000
8  053270    구영테크       1650       4865  194.848485
9  096040     이트론        279        791  183.512545
"""



### p311 듀얼 모멘텀 - 절대 모멘텀(Absolute Momentum)
# am = dm.get_abs_momentum(rm, '2020-01-01', '2020-12-31')

